coocox/Mplib/Toshaba/TMPM33x/TMPM333/cmsis_lib/lib/source/tmpm333_cg.c
/**
 *******************************************************************************
 * @file    tmpm333_cg.c
 * @brief   This file provides API functions for CG driver 
 * @version V2.1.0
 * @date    2010/06/23
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2010 All rights reserved
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "tmpm333_cg.h"

#if defined(__TMPM330_CG_H) || defined(__TMPM332_CG_H) || defined(__TMPM333_CG_H)
/** @addtogroup TX03_Periph_Driver
  * @{
  */

/** @defgroup CG
  * @brief CG driver modules
  * @{
  */

/** @defgroup CG_Private_Defines
  * @{
  */
#define CG_FC_GEAR_MASK             ((uint32_t)0xFFFFFFF8)
#define CG_FPSEL_MASK               ((uint32_t)0xFFFFEFFF)
#define CG_PRCLK_MASK               ((uint32_t)0xFFFFF8FF)
#define CG_SCOUT_MASK               ((uint32_t)0xFFFCFFFF)
#define CG_WUP_TIME_MASK            ((uint32_t)0xFFFFFF8F)
#define CG_WUP_COUNTER_MASK         ((uint32_t)0xFFFFFFF7)

#define CG_STBY_MODE_MASK           ((uint32_t)0xFFFFFFF8)

#define CG_NMI_FACTOR_PIN_WDT_MASK  ((uint32_t)0xFFFFFFFC)
#define CG_RESET_FLAG_MASK          ((uint32_t)0xFFFFFFE8)

#define FC_GEAR_1_1                 ((uint8_t)0x00)
#define FC_GEAR_1_2                 ((uint8_t)0x04)
#define FC_GEAR_1_4                 ((uint8_t)0x05)
#define FC_GEAR_1_8                 ((uint8_t)0x06)

#define FPERIPH_FGEAR               ((uint8_t)0x00)
#define FPERIPH_FC                  ((uint8_t)0x10)

#define PRCCLK_1_1                  ((uint8_t)0x00)

#define SCOUT_SRC_FS                ((uint32_t)0x00000000)
#define SCOUT_SRC_HALF_FSYS         ((uint32_t)0x00010000)
#define SCOUT_SRC_FSYS              ((uint32_t)0x00020000)
#define SCOUT_SRC_PHIT0             ((uint32_t)0x00030000)

#define WARM_UP_SEL_X1              ((uint8_t)0x00)
#define WARM_UP_SEL_XT1             ((uint8_t)0x08)
#define WARM_UP_TIME_NONE           ((uint8_t)0x00)
#define WARM_UP_TIME_X1_EXP10       ((uint8_t)0x01)
#define WARM_UP_TIME_XT1_EXP6       ((uint8_t)0x01)
#define WARM_UP_TIME_XT1_EXP15      ((uint8_t)0x04)

#define LOW_POWER_MODE_STOP         ((uint32_t)0x01)
#define LOW_POWER_MODE_SLEEP        ((uint32_t)0x02)
#define LOW_POWER_MODE_IDLE         ((uint32_t)0x03)

static CG_DivideLevel numToDivideLevel_table[CG_DIVIDE_MAX] = {
    CG_DIVIDE_1,
    CG_DIVIDE_2,
    CG_DIVIDE_4,
    CG_DIVIDE_8,
    CG_DIVIDE_16,
    CG_DIVIDE_32,
    CG_DIVIDE_64,
    CG_DIVIDE_128,
    CG_DIVIDE_256,
    CG_DIVIDE_UNKNOWN,
};

/** @} */
/* End of group CG_Private_Defines */

/** @defgroup CG_Private_FunctionPrototypes
  * @{
  */

/** @} */
/* End of group CG_Private_FunctionPrototypes */

/** @defgroup CG_Private_Functions
  * @{
  */

/** @} */
/* End of group CG_Private_Functions */

/** @defgroup CG_Exported_Functions
  * @{
  */

/**
  * @brief  set dividing level between clock fgear and fc.
  * @param  DivideFgearFromFc: dividing level between fgear and fc.
  *   This parameter can be one of the following values:
  *   CG_DIVIDE_1, CG_DIVIDE_2, CG_DIVIDE_4, CG_DIVIDE_8.
  * @retval None
  */
void CG_SetFgearLevel(CG_DivideLevel DivideFgearFromFc)
{
    uint8_t gear = FC_GEAR_1_1;
    uint32_t regval = TSB_CG->SYSCR;

    /* Check the parameters */
    assert_param(IS_CG_GEAR_DIVIDE_LEVEL(DivideFgearFromFc));

    /* set the value of fgear */
    switch (DivideFgearFromFc) {
    case CG_DIVIDE_1:
        gear = FC_GEAR_1_1;
        break;
    case CG_DIVIDE_2:
        gear = FC_GEAR_1_2;
        break;
    case CG_DIVIDE_4:
        gear = FC_GEAR_1_4;
        break;
    case CG_DIVIDE_8:
        gear = FC_GEAR_1_8;
        break;
    default:
        /*Do nothing */
        break;
    }
    regval &= CG_FC_GEAR_MASK;
    regval |= gear;
    TSB_CG->SYSCR = regval;
}

/**
  * @brief  get dividing level between clock fgear and fc.
  * @param  none
  * @retval  the dividing level between clock fgear and fc
  *   The value returned can be one of the following values:
  *   CG_DIVIDE_1, CG_DIVIDE_2, CG_DIVIDE_4 CG_DIVIDE_8 or CG_DIVIDE_UNKNOWN.
  */
CG_DivideLevel CG_GetFgearLevel(void)
{
    CG_DivideLevel DivideFgearFromFc = CG_DIVIDE_UNKNOWN;
    uint32_t syscr = TSB_CG->SYSCR;
    uint32_t tmp = ~CG_FC_GEAR_MASK;
    uint8_t gear = (uint8_t) (syscr & tmp);

    switch (gear) {
    case FC_GEAR_1_1:
        DivideFgearFromFc = CG_DIVIDE_1;
        break;
    case FC_GEAR_1_2:
        DivideFgearFromFc = CG_DIVIDE_2;
        break;
    case FC_GEAR_1_4:
        DivideFgearFromFc = CG_DIVIDE_4;
        break;
    case FC_GEAR_1_8:
        DivideFgearFromFc = CG_DIVIDE_8;
        break;
    default:
        /*Do nothing */
        break;
    }
    return DivideFgearFromFc;
}


/**
  * @brief  set dividing level between clock PhiT0 and fc.
  * @param  DividePhiT0FromFc: dividing level between PhiT0 and fc.
  *   This parameter can be one of the following values:
  *   CG_DIVIDE_1, CG_DIVIDE_2, CG_DIVIDE_4, CG_DIVIDE_8, CG_DIVIDE_16, CG_DIVIDE_32, 
  *   CG_DIVIDE_64, CG_DIVIDE_128 or CG_DIVIDE_256.
  * @retval result:success or not
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR.
  */
Result CG_SetPhiT0Level(CG_DivideLevel DividePhiT0FromFc)
{
    uint32_t fperiph = FPERIPH_FC;
    uint32_t fprclk = PRCCLK_1_1;
    CG_DivideLevel fgear;
    uint32_t tmp = 0U;
    Result retval = SUCCESS;
    uint32_t regval = TSB_CG->SYSCR;

    /* Check the parameters */
    assert_param(IS_CG_T0_DIVIDE_LEVEL(DividePhiT0FromFc));

    /* set the value of fgear */
    switch (DividePhiT0FromFc) {
    case CG_DIVIDE_1:
    case CG_DIVIDE_2:
    case CG_DIVIDE_4:
    case CG_DIVIDE_8:
    case CG_DIVIDE_16:
    case CG_DIVIDE_32:
        fprclk = (uint32_t) DividePhiT0FromFc;
        tmp = fperiph | fprclk;
        tmp <<= 8U;
        regval &= CG_FPSEL_MASK & CG_PRCLK_MASK;
        regval |= tmp;
        TSB_CG->SYSCR = regval;
        break;
    case CG_DIVIDE_64:
    case CG_DIVIDE_128:
    case CG_DIVIDE_256:
        fgear = CG_GetFgearLevel();
        if (fgear != CG_DIVIDE_UNKNOWN) {
            fprclk = (uint32_t) DividePhiT0FromFc - (uint32_t) fgear;
            if (fprclk <= CG_DIVIDE_32) {
                fperiph = FPERIPH_FGEAR;
                tmp = fperiph | fprclk;
                tmp <<= 8U;
                regval &= CG_FPSEL_MASK & CG_PRCLK_MASK;
                regval |= tmp;
                TSB_CG->SYSCR = regval;
            } else {
                retval = ERROR;
            }
        } else {
            retval = ERROR;
        }
        break;
    default:
        retval = ERROR;
        break;
    }
    return retval;
}

/**
  * @brief  get dividing level between clock phiT0 and fc.
  * @param  none
  * @retval  the divide level between clock phiT0 and fc
  *   The value returned can be one of the following values:
  *   CG_DIVIDE_1, CG_DIVIDE_2, CG_DIVIDE_4, CG_DIVIDE_8, CG_DIVIDE_16, CG_DIVIDE_32, 
  *   CG_DIVIDE_64, CG_DIVIDE_128 or CG_DIVIDE_256 or CG_DIVIDE_UNKNOWN.
  */
CG_DivideLevel CG_GetPhiT0Level(void)
{
    uint32_t tmp = 0U;
    uint32_t fprclk = 0U;
    CG_DivideLevel fgear;
    CG_DivideLevel phiT0Level = CG_DIVIDE_UNKNOWN;

    tmp = TSB_CG->SYSCR & (~CG_PRCLK_MASK);
    fprclk = (uint8_t) (tmp >> 8U);

    if (fprclk <= CG_DIVIDE_32) {
        if (TSB_CG_SYSCR_FPSEL == 1U) { /*FPERIPH_FC */
            phiT0Level = numToDivideLevel_table[fprclk];
        } else {
            fgear = CG_GetFgearLevel();
            if (fgear != CG_DIVIDE_UNKNOWN) {
                tmp = fprclk + fgear;
                if (tmp < CG_DIVIDE_UNKNOWN) {
                    phiT0Level = numToDivideLevel_table[tmp];
                } else {
                    /*Do nothing */
                }
            } else {
                /*Do nothing */
            }
        }
    }
    return phiT0Level;
}

/**
  * @brief  sets the source of SCOUT output
  * @param Source: select source of SCOUT
  *   This parameter can be one of the following values:
  *   CG_SCOUT_SRC_FS,CG_SCOUT_SRC_HALF_FSYS, CG_SCOUT_SRC_FSYS or CG_SCOUT_SRC_PHIT0.
  * @retval None
  */
void CG_SetSCOUTSrc(CG_SCOUTSrc Source)
{
    /*get the original SCOUT SRC value */
    uint32_t tmp = 0U;
    uint32_t regval = TSB_CG->SYSCR;

    /* Check the parameters */
    assert_param(IS_CG_SCOUT_SRC(Source));

    switch (Source) {
    case CG_SCOUT_SRC_FS:
        tmp = SCOUT_SRC_FS;
        break;
    case CG_SCOUT_SRC_HALF_FSYS:
        tmp = SCOUT_SRC_HALF_FSYS;
        break;
    case CG_SCOUT_SRC_FSYS:
        tmp = SCOUT_SRC_FSYS;
        break;
    case CG_SCOUT_SRC_PHIT0:
        tmp = SCOUT_SRC_PHIT0;
        break;
    default:
        /*Do nothing */
        break;
    }
    regval &= CG_SCOUT_MASK;
    regval |= tmp;
    TSB_CG->SYSCR = regval;
}

/**
  * @brief  get the source of SCOUT output..
  * @param None
  * @retval source of SCOUT output
  *   The value returned can be one of the following values:
  *   CG_SCOUT_SRC_FS, CG_SCOUT_SRC_FSYS, CG_SCOUT_SRC_PHIT0 or SCOUT_SRC_HALF_FSYS.
  */
CG_SCOUTSrc CG_GetSCOUTSrc(void)
{
    uint32_t tmp;
    CG_SCOUTSrc source = CG_SCOUT_SRC_FS;

    tmp = TSB_CG->SYSCR & (~CG_SCOUT_MASK);
    switch (tmp) {
    case SCOUT_SRC_FS:
        source = CG_SCOUT_SRC_FS;
        break;
    case SCOUT_SRC_HALF_FSYS:
        source = CG_SCOUT_SRC_HALF_FSYS;
        break;
    case SCOUT_SRC_FSYS:
        source = CG_SCOUT_SRC_FSYS;
        break;
    case SCOUT_SRC_PHIT0:
        source = CG_SCOUT_SRC_PHIT0;
        break;
    default:
        /*Do nothing */
        break;
    }
    return source;
}


/**
  * @brief  set the warm up time 
  * @param Source: select source of warm-up counter
  *   This parameter can be one of the following values:
  *   CG_WARM_UP_SRC_X1 or CG_WARM_UP_SRC_XT1.
  * @Time: select count time of warm-up timer
  *   This parameter can be one of the following values:
  *   CG_WARM_UP_TIME_NONE,CG_WARM_UP_TIME_EXP_6, CG_WARM_UP_TIME_EXP_7, 
  *   CG_WARM_UP_TIME_EXP_8,CG_WARM_UP_TIME_EXP_10,CG_WARM_UP_TIME_EXP_11, 
  *   CG_WARM_UP_TIME_EXP_12,CG_WARM_UP_TIME_EXP_13, CG_WARM_UP_TIME_EXP_14,
  *   CG_WARM_UP_TIME_EXP_15, CG_WARM_UP_TIME_EXP_16, CG_WARM_UP_TIME_EXP_17
  *   or CG_WARM_UP_TIME_EXP_18.
  * @retval success or not
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR.
  */
Result CG_SetWarmUpTime(CG_WarmUpSrc Source, CG_WarmUpTime Time)
{
    Result retval = SUCCESS;
    uint8_t warmup_counter = WARM_UP_SEL_X1;
    uint8_t regValForTime = WARM_UP_TIME_NONE;
    uint32_t tmp = 0U;
    uint32_t regval = TSB_CG->OSCCR;

    /* Check the parameters */
    assert_param(IS_CG_WARM_UP_SRC(Source));
    assert_param(IS_CG_WARM_UP_TIME(Time));

