coocox/Mplib/Toshaba/TMPM33x/TMPM333/cmsis_lib/lib/source/tmpm333_cg.c
    if (TSB_CG_CKSEL_SYSCKFLG == 1U) {
        fsyssrc = CG_FSYS_SRC_FS;
    } else {
        /*Do nothing */
    }
    return fsyssrc;
}

/**
  * @brief  setup the INT source for releasing low power mode.
  * @param INTSource: select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2,
  *   CG_INT_SRC_3, CG_INT_SRC_4, CG_INT_SRC_5(For M330/333),
  *   CG_INT_SRC_CEC_RX(For M330/332), CG_INT_SRC_RMC_RX_0(For M330/332),
  *   CG_INT_SRC_RTC, CG_INT_SRC_6(For M330/333), CG_INT_SRC_7(For M330/333),
  *   CG_INT_SRC_RMC_RX_1(For M330) or CG_INT_SRC_CEC_TX(For M330/332).
  * @paramActiveState: select the active state for release trigger
  *   For INTCECRX, INTRMCRX0 and INTRMCRX1, only "RISING" state will be set, no matter what the value of ActiveState is.
  *   For INTRTC and INTCECTX, only "FALLING" state will be set, no matter what the value of ActiveState is.
  *   This parameter can be one of the following values:
  *   CG_INT_ACTIVE_STATE_L, CG_INT_ACTIVE_STATE_H, CG_INT_ACTIVE_STATE_FALLING,
  *   CG_INT_ACTIVE_STATE_RISING or CG_INT_ACTIVE_STATE_BOTH_EDGES.
  * @NewState: enable or disable this release trigger
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  * @retval none
  */
void CG_SetSTBYReleaseINTSrc(CG_INTSrc INTSource,
                             CG_INTActiveState ActiveState, FunctionalState NewState)
{

    uint32_t active_setting = CG_INT_ACTIVE_STATE_L;
    uint32_t intxen = 0U;
    uint32_t regval;
    uint32_t mask = 0xffU;
    uint8_t leftshift_bits = 0U;

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));
    assert_param(IS_CG_INT_ACTIVE_STATE(ActiveState));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    switch (INTSource) {
    case CG_INT_SRC_0:
    case CG_INT_SRC_1:
    case CG_INT_SRC_2:
    case CG_INT_SRC_3:
        if (ActiveState < CG_INT_ACTIVE_STATE_INVALID) {
            /* calculate the register offset */
            leftshift_bits = ((uint8_t) INTSource) << 3U;

            regval = TSB_CG->IMCGA;
            active_setting = ActiveState;
            if (NewState == ENABLE) {
                intxen = 1U;
            }
            active_setting <<= 4U;
            active_setting <<= leftshift_bits;
            mask <<= leftshift_bits;
            mask = ~mask;
            regval &= mask;
            regval |= active_setting;
            TSB_CG->IMCGA = regval;
            regval |= intxen << leftshift_bits;
            TSB_CG->IMCGA = regval;
        } else {
            /*Do nothing */
        }
        break;
    case CG_INT_SRC_4:
#if defined(__TMPM330_CG_H)
    case CG_INT_SRC_5:
    case CG_INT_SRC_CEC_RX:
    case CG_INT_SRC_RMC_RX_0:
#elif defined(__TMPM332_CG_H)
    case CG_INT_SRC_CEC_RX:
    case CG_INT_SRC_RMC_RX_0:
#elif defined(__TMPM333_CG_H)
    case CG_INT_SRC_5:
#endif                          /* End of defined(__TMPM330_CG_H) */
        if (ActiveState < CG_INT_ACTIVE_STATE_INVALID) {
            /* calculate the register offset */
            leftshift_bits = ((uint8_t) INTSource) - ((uint8_t) CG_INT_SRC_4);
            leftshift_bits <<= 3U;

            if ((INTSource == CG_INT_SRC_4)
#if defined(__TMPM330_CG_H)||defined(__TMPM333_CG_H)
                || (INTSource == CG_INT_SRC_5)
#endif                          /* End of defined(__TMPM330_CG_H)||defined(__TMPM333_CG_H) */
                ) {
                active_setting = ActiveState;
            } else {
                active_setting = CG_INT_ACTIVE_STATE_RISING;
            }

            regval = TSB_CG->IMCGB;
            if (NewState == ENABLE) {
                intxen = 1U;
            }
            active_setting <<= 4U;
            active_setting <<= leftshift_bits;
            mask <<= leftshift_bits;
            mask = ~mask;
            regval &= mask;
            regval |= active_setting;
            TSB_CG->IMCGB = regval;
            regval |= intxen << leftshift_bits;
            TSB_CG->IMCGB = regval;
        } else {
            /*Do nothing */
        }
        break;
    case CG_INT_SRC_RTC:
#if defined(__TMPM330_CG_H)
    case CG_INT_SRC_6:
    case CG_INT_SRC_7:
    case CG_INT_SRC_RMC_RX_1:
#elif defined(__TMPM333_CG_H)
    case CG_INT_SRC_6:
    case CG_INT_SRC_7:
#endif                          /* End of defined(__TMPM330_CG_H) */
        if (ActiveState < CG_INT_ACTIVE_STATE_INVALID) {
            /* calculate the register offset */
            leftshift_bits = ((uint8_t) INTSource) - ((uint8_t) CG_INT_SRC_RTC);
            leftshift_bits <<= 3U;

            if (INTSource == CG_INT_SRC_RTC) {
                active_setting = CG_INT_ACTIVE_STATE_FALLING;
            }
#if defined(__TMPM330_CG_H)
            else if (INTSource == CG_INT_SRC_RMC_RX_1) {
                active_setting = CG_INT_ACTIVE_STATE_RISING;
            }
#endif                          /* End of defined(__TMPM330_CG_H) */
            else {
                active_setting = ActiveState;
            }

            regval = TSB_CG->IMCGC;
            if (NewState == ENABLE) {
                intxen = 1U;
            } else {
                /*Do nothing */
            }
            active_setting <<= 4U;
            active_setting <<= leftshift_bits;
            mask <<= leftshift_bits;
            mask = ~mask;
            regval &= mask;
            regval |= active_setting;
            TSB_CG->IMCGC = regval;
            regval |= intxen << leftshift_bits;
            TSB_CG->IMCGC = regval;
        }
        break;
#if defined(__TMPM330_CG_H)||defined(__TMPM332_CG_H)
    case CG_INT_SRC_CEC_TX:
        active_setting = CG_INT_ACTIVE_STATE_FALLING;

        regval = TSB_CG->IMCGD;
        if (NewState == ENABLE) {
            intxen = 1U;
        } else {
            /*Do nothing */
        }
        active_setting <<= 4U;
        mask = ~mask;
        regval &= mask;
        regval |= active_setting;
        TSB_CG->IMCGD = regval;
        regval |= intxen;
        TSB_CG->IMCGD = regval;
        break;
#endif                          /* End of defined(__TMPM330_CG_H)||defined(__TMPM332_CG_H) */
    default:
        /*Do nothing */
        break;
    }

